==================
Ref with string literal
==================

select * from {{ ref('my_table') }}

---

(source_file 
  (fn_call
    (identifier) 
    (lit_string)
  )
)

==================
Ref without string literal
==================

select * from {{ ref(not_a_string) }}

---

(source_file 
  (fn_call
    (identifier)
    (ERROR)
  )
)

==================
Config with one kwarg
==================

{{ config(key='value') }}

---

(source_file
  (fn_call
    (identifier)
    (kwarg
      (lit_string)
    )
  )
)

==================
Config with two kwargs
==================

{{ config(key='value', key2='value2') }}

---

(source_file
  (fn_call
    (identifier)
    (kwarg
      (lit_string)
    )
    (kwarg
      (lit_string)
    )
  )
)

==================
Fn with mixed lit and kwarg parameters
==================

{{ config(key='value', 'lit', key2='value2', 'lit2') }}

---

(source_file
  (fn_call
    (identifier)
    (kwarg
      (lit_string)
    )
    (lit_string)
    (kwarg
      (lit_string)
    )
    (lit_string)
  )
)
