==================
Ref with string literal
==================

select * from {{ ref('my_table') }}

---

(source_file 
  (fn_call
    (identifier) 
    (argument_list
      (lit_string)
    )
  )
)

==================
Ref without string literal
==================

select * from {{ ref(not_a_string) }}

---

(source_file 
  (fn_call
    (identifier)
    (argument_list
      (ERROR)
    )
  )
)

==================
Config with one kwarg
==================

{{ config(key='value') }}

---

(source_file
  (fn_call
    (identifier)
    (argument_list
      (kwarg
        (lit_string)
      )
    )
  )
)

==================
Config with two kwargs
==================

{{ config(key='value', key2='value2') }}

---

(source_file
  (fn_call
    (identifier)
    (argument_list
      (kwarg
        (lit_string)
      )
      (kwarg
        (lit_string)
      )
    )
  )
)

==================
Fn with mixed lit and kwarg parameters
==================

{{ config(key='value', 'lit', key2='value2', 'lit2') }}

---

(source_file
  (fn_call
    (identifier)
    (argument_list
      (kwarg
        (lit_string)
      )
      (lit_string)
      (kwarg
        (lit_string)
      )
      (lit_string)
    )
  )
)

==================
floating string literal
==================

{{ 'floating lit' }}

---

(source_file 
  (lit_string)
)

==================
bare words fail
==================

{{ text }}

---

(source_file
  (ERROR
    (identifier)
  )
)

==================
multiple jinja blocks
==================

some text {{ 'floating lit' }} more text {{ fn() }} text.

---

(source_file
  (lit_string)
  (fn_call
    (identifier)
    (argument_list)
  )
)
