==================
Ref with string literal
==================

select * from {{ ref('my_table') }}

---

(source_file 
  (fn 
    (lit_string)
  )
)

==================
Ref without string literal
==================

select * from {{ ref(not_a_string) }}

---

(source_file 
  (ERROR)
)

==================
Config with one kwarg
==================

{{ config(key='value') }}

---

(source_file
  (fn
    (kwarg
      (lit_string)
    )
  )
)

==================
Config with two kwargs
==================

{{ config(key='value', key2='value2') }}

---

(source_file
  (fn
    (kwarg
      (lit_string)
    )
    (kwarg
      (lit_string)
    )
  )
)
